РасширениеГТС/Джитиис/Catalogs/СделкиСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СделкиСКлиентами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаПроигрышаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПроигрышаСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоглашениеСКлиентом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПотенциальнаяСуммаПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВероятностьУспешногоЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделокСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбособленныйУчетТоваровПоСделке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаПервичногоСпроса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПервичныйСпрос</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаНеудовлетворения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныНеудовлетворенияПервичногоСпроса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентУдовлетворения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстовоеОписание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПартнерыИКонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВыигралСделку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РольПартнера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПартнеровВСделкахИПроектах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РольКонтактногоЛица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицВСделкахИПроектах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

РасширениеГТС/Джитиис/Catalogs/СделкиСКлиентами/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
&ИзменениеИКонтроль("КлиентПриИзменении")
Процедура асп_КлиентПриИзменении(Элемент)

	Если ИспользоватьСоглашенияСКлиентами Тогда
		Если Объект.Партнер.Пустая() Тогда
			Объект.СоглашениеСКлиентом = ПредопределенноеЗначение("Справочник.СоглашенияСКлиентами.ПустаяСсылка");
		Иначе

			СтруктураСоглашениеСКлиентом = ПолучитьУсловияПродажПоУмолчанию(Объект.Партнер);

			Если СтруктураСоглашениеСКлиентом = Неопределено Тогда
				Объект.СоглашениеСКлиентом = ПредопределенноеЗначение("Справочник.СоглашенияСКлиентами.ПустаяСсылка");
			Иначе
				Объект.СоглашениеСКлиентом = СтруктураСоглашениеСКлиентом.Соглашение;
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	ИзменилисьПараметрыОкруженияСделки = Истина;  
	
	#Вставка
	// Альтер ЛОГО+
	Объект.БизнесРегион = ПолучитьЗначениеРеквизитаНаСервере(Объект.Партнер, "БизнесРегион");
	ВыборКонтЛица = Неопределено;
	СтрокиСПустымиКонтактами = Объект.ПартнерыИКонтактныеЛица.НайтиСтроки(Новый Структура("Партнер, КонтактноеЛицо", Объект.Партнер, ПредопределенноеЗначение("Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка")));
	Если Объект.ПартнерыИКонтактныеЛица.Количество() = 0 
		ИЛИ СтрокиСПустымиКонтактами.Количество() = Объект.ПартнерыИКонтактныеЛица.Количество() Тогда
		// ищем контактные лица и даем на выбор пользователю
		СписокКонтЛиц = ПолучитьСписокКонтактныхЛицПартнераНаСервере();
		Если СписокКонтЛиц.Количество() > 0 Тогда
			ВыборКонтЛица = ВыбратьИзМеню(СписокКонтЛиц);
			Если ВыборКонтЛица <> Неопределено Тогда
				Если СтрокиСПустымиКонтактами.Количество() > 0 Тогда
					СтрокаКонтакта = СтрокиСПустымиКонтактами[0];
				Иначе
					СтрокаКонтакта = Объект.ПартнерыИКонтактныеЛица.Добавить();
					СтрокаКонтакта.Партнер = Объект.Партнер;
				КонецЕсли;	
				СтрокаКонтакта.КонтактноеЛицо = ВыборКонтЛица.Значение;	

				Картинка = ВыборКонтЛица.Картинка;

				Если Картинка = БиблиотекаКартинок.КИ_ПочтовыйКонверт Тогда
					Объект.СпособОбращения = ПредопределенноеЗначение("Перечисление.СпособыОбращения.Почта");
				ИначеЕсли Картинка = БиблиотекаКартинок.КИ_имейл Тогда
					Объект.СпособОбращения = ПредопределенноеЗначение("Перечисление.СпособыОбращения.ЭлектроннаяПочта");
				ИначеЕсли Картинка = БиблиотекаКартинок.КИ_телефон Тогда
					Объект.СпособОбращения = ПредопределенноеЗначение("Перечисление.СпособыОбращения.ТелефонныйЗвонок");
				Иначе
					Объект.СпособОбращения = ПредопределенноеЗначение("Перечисление.СпособыОбращения.Встреча");
				КонецЕсли;

			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = СокрЛП(Объект.Партнер) + ?(ВыборКонтЛица = Неопределено, "", "," + СокрЛП(ВыборКонтЛица.Представление))
		+ ", " + Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	Если ПустаяСтрока(Объект.ФИО) Тогда
		Объект.ФИО = ?(ВыборКонтЛица = Неопределено, "", СтрокаКонтакта.КонтактноеЛицо);
		Если Объект.СпособОбращения = ПредопределенноеЗначение("Перечисление.СпособыОбращения.ТелефонныйЗвонок") Тогда
			Объект.НомерТелефона = ?(ВыборКонтЛица = Неопределено, "", Прав(ВыборКонтЛица.Представление, СтрДлина(ВыборКонтЛица.Представление) - Найти(ВыборКонтЛица.Представление, "// ") - 2 ) );
		КонецЕсли;
		Если Объект.СпособОбращения = ПредопределенноеЗначение("Перечисление.СпособыОбращения.ЭлектроннаяПочта") и СписокКонтЛиц.Количество() > 0 Тогда
			Для каждого Контакт из СписокКонтЛиц Цикл
				Если Контакт.Картинка = БиблиотекаКартинок.КИ_телефон И Контакт.Значение = ВыборКонтЛица.Значение Тогда
					Объект.НомерТелефона = ?(ВыборКонтЛица = Неопределено, "", Прав(Контакт.Представление, СтрДлина(Контакт.Представление)  - Найти(Контакт.Представление, "// ") - 2 ) );
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Партнер)  Тогда
		//++Непп 
		найденопродаж = ПолучитьПродажи();
		Если найденопродаж = истина тогда
			СтарКл=1;
			ТЗ= ПолучитьТЗСегм();

			Для Каждого Выборка из ТЗ Цикл
				Если Выборка=ПредопределенноеЗначение("Справочник.СегментыПартнеров.ВипКлиенты") Тогда
					СтарКл=0;	
					КаналПервичногоИнтереса = ПолучитьПВХ("СтарыйКлиент");
					//Элементы.КаналПервичногоИнтереса.Доступность = Ложь;
					ИсточникПервичногоИнтереса = Неопределено;
					Элементы.ИсточникПервичногоИнтереса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.МаркетинговыеМероприятия");
					ЗаполнитьМаркетинговоеМероприятиеВип();
					Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Ложь;

				ИначеЕсли Выборка=ПредопределенноеЗначение("Справочник.СегментыПартнеров.Дилеры" )Тогда
					СтарКл=0;	
					КаналПервичногоИнтереса = ПолучитьПВХ("СтарыйКлиент");
					//Элементы.КаналПервичногоИнтереса.Доступность = Ложь;
					ИсточникПервичногоИнтереса = Неопределено;
					Элементы.ИсточникПервичногоИнтереса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.МаркетинговыеМероприятия");
					ЗаполнитьМаркетинговоеМероприятиеДилер();
					Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Ложь;

				ИначеЕсли Выборка=ПредопределенноеЗначение("Справочник.СегментыПартнеров.КрупныеДилеры" )Тогда
					СтарКл=0;	
					КаналПервичногоИнтереса = ПолучитьПВХ("СтарыйКлиент");
					//Элементы.КаналПервичногоИнтереса.Доступность = Ложь;
					ИсточникПервичногоИнтереса = Неопределено;
					Элементы.ИсточникПервичногоИнтереса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.МаркетинговыеМероприятия");
					ЗаполнитьМаркетинговоеМероприятиеКрупныеДилеры();
					Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Ложь;


				КонецЕсли;
			КонецЦикла;



			Если СтарКл=1 Тогда
				КаналПервичногоИнтереса = ПредопределенноеЗначение("ПланВидовХарактеристик.КаналыРекламныхВоздействий.СтарыйКлиент");
				//Элементы.КаналПервичногоИнтереса.Доступность = Ложь;
				ИсточникПервичногоИнтереса = Неопределено;
				Элементы.ИсточникПервичногоИнтереса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.МаркетинговыеМероприятия");
				ЗаполнитьМаркетинговоеМероприятиеПоУмолчаниюСервер();
				Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Ложь;
			КонецЕсли;

		КонецЕсли;




	Иначе
		Элементы.КаналПервичногоИнтереса.Доступность = Истина;
		Элементы.ИсточникПервичногоИнтереса.ТолькоПросмотр = Истина;
		КаналПервичногоИнтереса = Неопределено;
		ИсточникПервичногоИнтереса = Неопределено;
	КонецЕсли;	
	// +Альтер ЛОГО
	Если Не ЗначениеЗаполнено(Объект.СоглашениеСКлиентом) Тогда
		Объект.СоглашениеСКлиентом=ПолучитьСоглашениеПоУмолчанию();
	КонецЕсли;
	//Асист KS	
	// Объект.КодКлиента = ПолучитьКодКлиента();
	//Асист KS
	#КонецВставки
КонецПроцедуры  


Функция ПолучитьПВХ(ИмяСвойства)

	Возврат ПланыВидовХарактеристик.КаналыРекламныхВоздействий.НайтиПоНаименованию(ИмяСвойства, Истина);	
	

КонецФункции
